xueliu/nRF52/nrf5_iot_sdk_3288530/examples/iot/cloud/mqtt/subscriber/main.c
    static app_button_cfg_t buttons[] =
    {
        {BSP_BUTTON_0,        false, BUTTON_PULL, button_event_handler},
        {BSP_BUTTON_1,        false, BUTTON_PULL, button_event_handler},
#ifdef COMMISSIONING_ENABLED
        {ERASE_BUTTON_PIN_NO, false, BUTTON_PULL, button_event_handler}
#endif // COMMISSIONING_ENABLED
    };

    #define BUTTON_DETECTION_DELAY APP_TIMER_TICKS(50, APP_TIMER_PRESCALER)

    err_code = app_button_init(buttons, sizeof(buttons) / sizeof(buttons[0]), BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);

    err_code = app_button_enable();
    APP_ERROR_CHECK(err_code);
}


/**@brief Asynchronous event notification callback registered by the application with the module to receive MQTT events. */
static void app_mqtt_evt_handler(mqtt_client_t * p_client, const mqtt_evt_t * p_evt)
{
    uint32_t err_code;
    switch(p_evt->id)
    {
        case MQTT_EVT_CONNECT:
        {
            APPL_LOG("[APPL]: >> MQTT_EVT_CONNECT, result: 0x%08x\r\n", p_evt->result);

            if(p_evt->result == NRF_SUCCESS)
            {
                m_connection_state = true;
                m_display_state = LEDS_CONNECTED_TO_BROKER;

                // Subscribe to MQTT Broker.
                app_xively_subscribe();
            }
            break;
        }
        case MQTT_EVT_PUBLISH:
        {
            APPL_LOG ("[APPL]: >> MQTT_EVT_PUBLISH\r\n");

            char     * p_fragment;
            char     * p_data_start;
            uint16_t   temperature;

            memcpy(m_data_rcv,
                   p_evt->param.pub_message.message.payload.p_bin_str,
                   p_evt->param.pub_message.message.payload.bin_strlen);
            
            m_data_rcv[p_evt->param.pub_message.message.payload.bin_strlen] = 0;

            // Find fragment containing current value of Temperature.
            p_fragment   = strstr(m_data_rcv, "\"current_value\"");
            p_data_start = strtok(p_fragment, ":");
            p_data_start = strtok(NULL, ",");

            p_data_start    = p_data_start + 1;
            p_data_start[5] = 0;

            // Change string to uint16_t value.
            temperature = 10 * (p_data_start[0] - '0') + (p_data_start[1] - '0');

            // Change leds sate to indicate actual data that has been sent.
            switch(temperature % 4)
            {
              case 0:
                LEDS_OFF(LED_THREE | LED_FOUR);
                break;
              case 1:
                LEDS_ON(LED_FOUR);
                LEDS_OFF(LED_THREE);
                break;
              case 2:
                LEDS_ON(LED_THREE);
                LEDS_OFF(LED_FOUR);
                break;
              case 3:
                LEDS_ON(LED_THREE | LED_FOUR);
                break;
            }

            APPL_LOG ("[APPL]: Current value of channel Temperature: %s\r\n", p_data_start);
            
            if (p_evt->param.pub_message.message.topic.qos == MQTT_QoS_0_AT_MOST_ONCE)
            {
                // Send pub ack.
                err_code = mqtt_publish_ack(p_client, p_evt->param.pub_message.message_id);
                if(err_code != NRF_SUCCESS)
                {
                    APPL_LOG ("[APPL]: mqtt_publish_ack failed, reason 0x%08x\r\n", err_code);
                }
            }

          break;
        }
        case MQTT_EVT_DISCONNECT:
        {
            APPL_LOG ("[APPL]: >> MQTT_EVT_DISCONNECT\r\n");
            m_connection_state = false;
            m_display_state    = LEDS_IPV6_IF_UP;

            // Make reconnection in case of tcp problem.
            if(p_evt->result == MQTT_ERR_TRANSPORT_CLOSED)
            {
                err_code = app_timer_start(m_mqtt_conn_timer_id, APP_XIVELY_CONNECT_DELAY, NULL);
                APP_ERROR_CHECK(err_code);
            }

            break;
        }
        default:
            break;
    }
}


/**@brief Function for subscribing to specific MQTT topic.
 *
 * @details Subscribe to MQTT Xively topic.
 */
static void app_xively_subscribe(void)
{
    uint32_t err_code;

    if (m_connection_state == false)
    {
        return;
    }

    // Create MQTT topic.
    #define NUMBER_OF_SUBSCRIBED_TOPICS  1
    
    mqtt_topic_t topic[NUMBER_OF_SUBSCRIBED_TOPICS];
    
    topic[0].topic.p_utf_str   = (uint8_t *)APP_MQTT_XIVELY_API_URL;
    topic[0].topic.utf_strlen  = strlen(APP_MQTT_XIVELY_API_URL);
    topic[0].qos               = MQTT_QoS_0_AT_MOST_ONCE;
    
    mqtt_subscription_list_t subscription_list;
    
    subscription_list.list_count = NUMBER_OF_SUBSCRIBED_TOPICS;
    subscription_list.p_list     = &topic[0];
    subscription_list.message_id = m_packet_id;

    err_code = mqtt_subscribe(&m_app_mqtt_id, &subscription_list);

    // Check if there is no pending transaction.
    if(err_code != (NRF_ERROR_BUSY | IOT_MQTT_ERR_BASE))
    {
        APP_ERROR_CHECK(err_code);
    }
    else
    {
        m_packet_id+= 2; // Avoid ever sending invalid message id 0.
    }

    APPL_LOG("[APPL]: mqtt_subscribe result 0x%08lx\r\n", err_code);
}


/**@brief Timer callback used for connecting to Xively cloud.
 *
 * @param[in]   p_context   Pointer used for passing context. No context used in this application.
 */
static void app_xively_connect(void * p_context)
{
    UNUSED_VARIABLE(p_context);

    uint32_t       err_code;
    static mqtt_username_t username;
    username.p_utf_str  = (uint8_t *)m_user;
    username.utf_strlen = strlen(m_user);

    mqtt_client_init(&m_app_mqtt_id);
    
    memcpy (m_app_mqtt_id.broker_addr.u8, m_broker_addr, IPV6_ADDR_SIZE);
    m_app_mqtt_id.broker_port             = APP_MQTT_XIVELY_BROKER_PORT;
    m_app_mqtt_id.evt_cb                  = app_mqtt_evt_handler;
    m_app_mqtt_id.client_id.p_utf_str     = (uint8_t *)m_device_id;
    m_app_mqtt_id.client_id.utf_strlen    = strlen(m_device_id);
    m_app_mqtt_id.p_password              = NULL;
    m_app_mqtt_id.p_user_name             = (mqtt_username_t *)&username;
    m_app_mqtt_id.transport_type          = MQTT_TRANSPORT_SECURE;
    m_app_mqtt_id.p_security_settings     = &m_tls_keys;

    err_code = mqtt_connect(&m_app_mqtt_id);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing IP stack.
 *
 * @details Initialize the IP Stack and its driver.
 */
static void ip_stack_init(void)
{
    uint32_t err_code; 

    err_code = ipv6_medium_eui64_get(m_ipv6_medium.ipv6_medium_instance_id, \
                                     &eui64_local_iid);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_mem_init();
    APP_ERROR_CHECK(err_code);

    //Initialize LwIP stack.
    lwip_init();

